_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 112, 112, 20, 3)   0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 112, 112, 20, 64)  5248      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 56, 56, 20, 64)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 56, 56, 20, 128)   221312    
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 28, 28, 10, 128)   0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 28, 28, 10, 128)   442496    
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 14, 14, 5, 128)    0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 14, 14, 5, 256)    884992    
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 7, 7, 3, 256)      0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 7, 7, 3, 256)      1769728   
_________________________________________________________________
max_pooling3d_5 (MaxPooling3 (None, 4, 4, 2, 256)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               4194816   
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                16416     
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 132       
=================================================================