__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 112, 112, 20, 0                                            
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 56, 56, 10, 6 65920       input_2[0][0]                    
__________________________________________________________________________________________________
max_pooling3d_1 (MaxPooling3D)  (None, 28, 28, 5, 64 0           conv3d_9[0][0]                   
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 28, 28, 5, 64 110656      max_pooling3d_1[0][0]            
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 28, 28, 5, 64 110656      conv3d_10[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 28, 28, 5, 64 0           conv3d_11[0][0]                  
                                                                 max_pooling3d_1[0][0]            
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 28, 28, 5, 64 110656      add_1[0][0]                      
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 28, 28, 5, 64 110656      conv3d_12[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 28, 28, 5, 64 0           conv3d_13[0][0]                  
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 14, 14, 3, 12 221312      add_2[0][0]                      
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 14, 14, 3, 12 442496      conv3d_15[0][0]                  
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 14, 14, 3, 12 221312      add_2[0][0]                      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 14, 14, 3, 12 0           conv3d_16[0][0]                  
                                                                 conv3d_14[0][0]                  
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 14, 14, 3, 12 442496      add_3[0][0]                      
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 14, 14, 3, 12 442496      conv3d_17[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 14, 14, 3, 12 0           conv3d_18[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 7, 7, 2, 256) 884992      add_4[0][0]                      
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 7, 7, 2, 256) 1769728     conv3d_20[0][0]                  
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 7, 7, 2, 256) 884992      add_4[0][0]                      
__________________________________________________________________________________________________
add_5 (Add)                     (None, 7, 7, 2, 256) 0           conv3d_21[0][0]                  
                                                                 conv3d_19[0][0]                  
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 7, 7, 2, 256) 1769728     add_5[0][0]                      
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (None, 7, 7, 2, 256) 1769728     conv3d_22[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 7, 7, 2, 256) 0           conv3d_23[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
conv3d_25 (Conv3D)              (None, 4, 4, 1, 512) 3539456     add_6[0][0]                      
__________________________________________________________________________________________________
conv3d_26 (Conv3D)              (None, 4, 4, 1, 512) 7078400     conv3d_25[0][0]                  
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (None, 4, 4, 1, 512) 3539456     add_6[0][0]                      
__________________________________________________________________________________________________
add_7 (Add)                     (None, 4, 4, 1, 512) 0           conv3d_26[0][0]                  
                                                                 conv3d_24[0][0]                  
__________________________________________________________________________________________________
conv3d_27 (Conv3D)              (None, 4, 4, 1, 512) 7078400     add_7[0][0]                      
__________________________________________________________________________________________________
conv3d_28 (Conv3D)              (None, 4, 4, 1, 512) 7078400     conv3d_27[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 4, 4, 1, 512) 0           conv3d_28[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
average_pooling3d_1 (AveragePoo (None, 2, 2, 1, 512) 0           add_8[0][0]                      
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 2048)         0           average_pooling3d_1[0][0]        
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1000)         2049000     flatten_2[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1000)         0           dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 32)           32032       dropout_3[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 32)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 4)            132         dropout_4[0][0]                  
==================================================================================================