Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 112, 112, 8, 3)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 112, 112, 8, 64)   5248      
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 112, 112, 8, 64)   110656    
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 56, 56, 8, 64)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 56, 56, 8, 128)    221312    
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 56, 56, 8, 128)    442496    
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 28, 28, 4, 128)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 28, 28, 4, 256)    884992    
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 28, 28, 4, 256)    1769728   
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 28, 28, 4, 256)    1769728   
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 14, 14, 2, 256)    0         
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 14, 14, 2, 512)    3539456   
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 14, 14, 2, 512)    7078400   
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 14, 14, 2, 512)    7078400   
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 7, 7, 1, 512)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 25088)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              102764544 
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 16388     
=================================================================