_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 112, 112, 20, 3)   0         
_________________________________________________________________
conv3d_29 (Conv3D)           (None, 112, 112, 20, 64)  5248      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 112, 112, 20, 64)  0         
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 56, 56, 20, 64)    0         
_________________________________________________________________
conv3d_30 (Conv3D)           (None, 56, 56, 20, 128)   221312    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 56, 56, 20, 128)   0         
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 28, 28, 10, 128)   0         
_________________________________________________________________
conv3d_31 (Conv3D)           (None, 28, 28, 10, 128)   442496    
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 28, 28, 10, 128)   0         
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 14, 14, 5, 128)    0         
_________________________________________________________________
conv3d_32 (Conv3D)           (None, 14, 14, 5, 256)    884992    
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 14, 14, 5, 256)    0         
_________________________________________________________________
max_pooling3d_5 (MaxPooling3 (None, 7, 7, 3, 256)      0         
_________________________________________________________________
conv3d_33 (Conv3D)           (None, 7, 7, 3, 256)      1769728   
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 7, 7, 3, 256)      0         
_________________________________________________________________
max_pooling3d_6 (MaxPooling3 (None, 4, 4, 2, 256)      0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 512)               4194816   
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 512)               0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                16416     
_________________________________________________________________
dropout_6 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 4)                 132       
=================================================================