Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 112, 112, 20, 3)   0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 112, 112, 20, 64)  5248      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 56, 56, 20, 64)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 56, 56, 20, 128)   221312    
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 28, 28, 10, 128)   0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 28, 28, 10, 256)   884992    
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 28, 28, 10, 256)   1769728   
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 14, 14, 5, 256)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 14, 14, 5, 512)    3539456   
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 14, 14, 5, 512)    7078400   
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 7, 7, 2, 512)      0         
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 7, 7, 2, 512)      7078400   
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 7, 7, 2, 512)      7078400   
_________________________________________________________________
zero_padding3d_1 (ZeroPaddin (None, 9, 9, 2, 512)      0         
_________________________________________________________________
max_pooling3d_5 (MaxPooling3 (None, 4, 4, 1, 512)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              33558528  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 16388   