_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 112, 112, 20, 3)   0         
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 112, 112, 20, 32)  2624      
_________________________________________________________________
max_pooling3d_8 (MaxPooling3 (None, 56, 56, 20, 32)    0         
_________________________________________________________________
conv3d_11 (Conv3D)           (None, 56, 56, 20, 64)    55360     
_________________________________________________________________
max_pooling3d_9 (MaxPooling3 (None, 28, 28, 20, 64)    0         
_________________________________________________________________
conv3d_12 (Conv3D)           (None, 28, 28, 20, 64)    110656    
_________________________________________________________________
conv3d_13 (Conv3D)           (None, 28, 28, 20, 64)    110656    
_________________________________________________________________
max_pooling3d_10 (MaxPooling (None, 14, 14, 10, 64)    0         
_________________________________________________________________
conv3d_14 (Conv3D)           (None, 14, 14, 10, 128)   221312    
_________________________________________________________________
max_pooling3d_11 (MaxPooling (None, 7, 7, 5, 128)      0         
_________________________________________________________________
conv3d_15 (Conv3D)           (None, 7, 7, 5, 128)      442496    
_________________________________________________________________
conv3d_16 (Conv3D)           (None, 7, 7, 5, 128)      442496    
_________________________________________________________________
max_pooling3d_12 (MaxPooling (None, 4, 4, 3, 128)      0         
_________________________________________________________________
conv3d_17 (Conv3D)           (None, 4, 4, 3, 256)      884992    
_________________________________________________________________
conv3d_18 (Conv3D)           (None, 4, 4, 3, 256)      1769728   
_________________________________________________________________
conv3d_19 (Conv3D)           (None, 4, 4, 3, 256)      1769728   
_________________________________________________________________
max_pooling3d_13 (MaxPooling (None, 2, 2, 2, 256)      0         
_________________________________________________________________
conv3d_20 (Conv3D)           (None, 2, 2, 2, 512)      3539456   
_________________________________________________________________
conv3d_21 (Conv3D)           (None, 2, 2, 2, 512)      7078400   
_________________________________________________________________
conv3d_22 (Conv3D)           (None, 2, 2, 2, 512)      7078400   
_________________________________________________________________
max_pooling3d_14 (MaxPooling (None, 1, 1, 1, 512)      0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 512)               262656    
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 32)                16416     
_________________________________________________________________
dropout_4 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================