_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 112, 112, 20, 3)   0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 112, 112, 20, 32)  2624      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 56, 56, 20, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 56, 56, 20, 64)    55360     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 28, 28, 20, 64)    0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 28, 28, 20, 64)    110656    
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 14, 14, 10, 64)    0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 14, 14, 10, 128)   221312    
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 7, 7, 5, 128)      0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 7, 7, 5, 128)      442496    
_________________________________________________________________
max_pooling3d_5 (MaxPooling3 (None, 4, 4, 3, 128)      0         
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 4, 4, 3, 256)      884992    
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 4, 4, 3, 256)      1769728   
_________________________________________________________________
max_pooling3d_6 (MaxPooling3 (None, 2, 2, 2, 256)      0         
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 2, 2, 2, 512)      3539456   
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 2, 2, 2, 512)      7078400   
_________________________________________________________________
max_pooling3d_7 (MaxPooling3 (None, 1, 1, 1, 512)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                16416     
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 132       
=================================================================